brew "bat"
brew "coreutils"
brew "tree-sitter"
brew "cask"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "icu4c@78"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gnupg"
brew "pkgconf"
brew "lilypond"
brew "lsd"
brew "mise"
brew "neovim"
brew "sheldon"
brew "sqruff"
brew "starship"
brew "tree"
brew "tree-sitter-cli"
brew "xh"
brew "zoxide"
cask "antigravity"
cask "blender"
cask "claude-code"
cask "cursor"
cask "dbeaver-community"
cask "discord"
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-ibm-plex-mono"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-terminess-ttf-nerd-font"
cask "fork"
cask "gcloud-cli"
cask "google-chrome"
cask "macpass"
cask "notion"
cask "obsidian"
cask "raycast"
cask "slack"
cask "spotify"
cask "todoist-app"
cask "visual-studio-code"
cask "wezterm"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "foam.foam-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "jeandeaual.lilypond-syntax"
vscode "jeandeaual.scheme"
vscode "johnpapa.winteriscoming"
vscode "kimlimjustin.jsdoc-generator"
vscode "lhl2617.lilypond-formatter"
vscode "lhl2617.lilypond-pdf-preview"
vscode "lhl2617.lilypond-snippets"
vscode "lhl2617.vslilypond"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "quary.sqruff"
vscode "ritwickdey.liveserver"
vscode "shinichi-takii.sql-bigquery"
vscode "silofy.hackthebox"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
