# ── CLI tools ──────────────────────────────────────────────────────────────
brew "bat"          # cat 代替：シンタックスハイライト付きファイル表示
brew "bottom"       # top 代替：CPU/メモリ/ネットワークをグラフ表示
brew "coreutils"    # GNU コアユーティリティ（gls, gdate など）
brew "tree-sitter"  # 構文解析ライブラリ（Neovim 依存）
brew "dust"         # du 代替：ディスク使用量をツリー表示
brew "eza"          # ls 代替：アイコン・git 情報付きリスト表示
brew "fd"           # find 代替：高速ファイル検索
brew "fzf"          # ファジーファインダー（インタラクティブ絞り込み）
brew "gawk"         # AWK の GNU 実装（スクリプト用）
brew "git-delta"    # git diff の syntax highlighter
brew "procs"        # ps 代替：カラー付きプロセス一覧
brew "ripgrep"      # grep 代替：高速全文検索（fzf・Neovim Telescope と連携）
brew "rm-improved"  # rm 代替：削除ファイルをゴミ箱に送り復元可能にする
brew "sd"           # sed 代替：直感的な文字列置換
brew "shellcheck"   # シェルスクリプト静的解析（CI / ローカル共用）
brew "stylua"       # Lua フォーマッタ（Neovim conform.nvim 用）
brew "prettier"     # JS/TS/Markdown/JSON/YAML/HTML/CSS フォーマッタ（Neovim conform.nvim 用）
brew "tree"         # ディレクトリツリー表示
brew "xh"           # curl 代替：HTTP リクエストクライアント
brew "zoxide"       # cd 代替：履歴ベースのスマートディレクトリ移動

# ── Shell / Prompt ─────────────────────────────────────────────────────────
brew "sheldon"      # zsh プラグインマネージャ
brew "starship"     # クロスシェル対応プロンプト

# ── Runtime / Package manager ──────────────────────────────────────────────
brew "mise"         # Python/Node.js/Poetry などランタイムバージョン管理
brew "node"         # Node.js（mise 管理外のグローバルツール用）

# ── Editor ─────────────────────────────────────────────────────────────────
brew "neovim"       # テキストエディタ

# ── Git / GitHub ───────────────────────────────────────────────────────────
brew "git"          # バージョン管理
brew "gh"           # GitHub CLI

# ── Container ──────────────────────────────────────────────────────────────
brew "docker"       # コンテナランタイム
brew "docker-compose" # マルチコンテナ定義・実行

# ── SQL ────────────────────────────────────────────────────────────────────
brew "sqruff"       # SQL リンター（CLI）

# ── AI / Dev tools ─────────────────────────────────────────────────────────
brew "gemini-cli"   # Google Gemini CLI

# ── Security ───────────────────────────────────────────────────────────────
brew "gnupg"        # GPG 署名・暗号化

# ── Build dependencies ─────────────────────────────────────────────────────
brew "pkgconf"      # pkg-config 代替（ライブラリビルド依存）
brew "icu4c@78"     # Unicode/国際化ライブラリ（各種ツール依存）
brew "tree-sitter-cli" # Tree-sitter 文法ファイル生成 CLI

# ── Music notation ─────────────────────────────────────────────────────────
brew "lilypond"     # 楽譜作成ツール

# ── Apps ───────────────────────────────────────────────────────────────────
brew "cask"         # Homebrew Cask 本体

# ── Cask: Development ──────────────────────────────────────────────────────
cask "claude-code"         # Anthropic Claude Code デスクトップアプリ
cask "visual-studio-code"  # コードエディタ
cask "zed"                 # 高速コードエディタ
cask "wezterm"             # GPU アクセラレーション対応ターミナル
cask "fork"                # Git GUI クライアント
cask "dbeaver-community"   # DB ユニバーサルクライアント
cask "gcloud-cli"          # Google Cloud SDK

# ── Cask: Productivity ─────────────────────────────────────────────────────
cask "raycast"      # ランチャー・ワークフロー自動化
cask "notion"       # ドキュメント・ナレッジベース
cask "obsidian"     # マークダウンベースのノートアプリ
cask "todoist-app"  # タスク管理
cask "macpass"      # KeePass 互換パスワードマネージャ

# ── Cask: Communication ────────────────────────────────────────────────────
cask "slack"        # チームチャット
cask "discord"      # コミュニティチャット

# ── Cask: Media / Creative ─────────────────────────────────────────────────
cask "blender"      # 3D モデリング・アニメーション
cask "spotify"      # 音楽ストリーミング

# ── Cask: Browser ──────────────────────────────────────────────────────────
cask "google-chrome" # Web ブラウザ

# ── Cask: Fonts ────────────────────────────────────────────────────────────
cask "font-3270-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-ibm-plex-mono"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-terminess-ttf-nerd-font"

# ── VSCode Extensions ──────────────────────────────────────────────────────
# -- General
vscode "alexcvzz.vscode-sqlite"
vscode "bierner.markdown-mermaid"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "hediet.vscode-drawio"
vscode "janisdd.vscode-edit-csv"
vscode "johnpapa.winteriscoming"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "silofy.hackthebox"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "yzhang.markdown-all-in-one"
vscode "yzane.markdown-pdf"
vscode "takumii.markdowntable"
# -- Python
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "njpwerner.autodocstring"
# -- Jupyter
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
# -- SQL
vscode "quary.sqruff"
vscode "shinichi-takii.sql-bigquery"
# -- LilyPond
vscode "jeandeaual.lilypond-syntax"
vscode "lhl2617.lilypond-formatter"
vscode "lhl2617.lilypond-pdf-preview"
vscode "lhl2617.lilypond-snippets"
vscode "lhl2617.vslilypond"
# -- AI
vscode "anthropic.claude-code"
vscode "google.gemini-cli-vscode-ide-companion"
# -- JavaScript
vscode "kimlimjustin.jsdoc-generator"
vscode "jeandeaual.scheme"
# -- GitHub
vscode "github.vscode-github-actions"
# -- Foam (ナレッジグラフ)
vscode "foam.foam-vscode"
